Duet3D/Duet3Expansion/src/atmel/SAME70_DFP/2.3.98/same70b/atdf/ATSAME70N20B.atdf
      <value-group caption="" name="HSMCI_CMDR__MAXLAT">
        <value caption="5-cycle max latency." name="_5" value="0"/>
        <value caption="64-cycle max latency." name="_64" value="1"/>
      </value-group>
      <value-group caption="" name="HSMCI_CMDR__TRCMD">
        <value caption="No data transfer" name="NO_DATA" value="0x0"/>
        <value caption="Start data transfer" name="START_DATA" value="0x1"/>
        <value caption="Stop data transfer" name="STOP_DATA" value="0x2"/>
      </value-group>
      <value-group caption="" name="HSMCI_CMDR__TRDIR">
        <value caption="Write." name="WRITE" value="0"/>
        <value caption="Read." name="READ" value="1"/>
      </value-group>
      <value-group caption="" name="HSMCI_CMDR__TRTYP">
        <value caption="MMC/SD Card Single Block" name="SINGLE" value="0x0"/>
        <value caption="MMC/SD Card Multiple Block" name="MULTIPLE" value="0x1"/>
        <value caption="MMC Stream" name="STREAM" value="0x2"/>
        <value caption="SDIO Byte" name="BYTE" value="0x4"/>
        <value caption="SDIO Block" name="BLOCK" value="0x5"/>
      </value-group>
      <value-group caption="" name="HSMCI_CMDR__IOSPCMD">
        <value caption="Not an SDIO Special Command" name="STD" value="0x0"/>
        <value caption="SDIO Suspend Command" name="SUSPEND" value="0x1"/>
        <value caption="SDIO Resume Command" name="RESUME" value="0x2"/>
      </value-group>
      <value-group caption="" name="HSMCI_CMDR__ATACS">
        <value caption="Normal operation mode." name="NORMAL" value="0"/>
        <value caption="This bit indicates that a completion signal is expected within a programmed amount of time (HSMCI_CSTOR)." name="COMPLETION" value="1"/>
      </value-group>
      <value-group caption="" name="HSMCI_CSTOR__CSTOMUL">
        <value caption="CSTOCYC x 1" name="_1" value="0x0"/>
        <value caption="CSTOCYC x 16" name="_16" value="0x1"/>
        <value caption="CSTOCYC x 128" name="_128" value="0x2"/>
        <value caption="CSTOCYC x 256" name="_256" value="0x3"/>
        <value caption="CSTOCYC x 1024" name="_1024" value="0x4"/>
        <value caption="CSTOCYC x 4096" name="_4096" value="0x5"/>
        <value caption="CSTOCYC x 65536" name="_65536" value="0x6"/>
        <value caption="CSTOCYC x 1048576" name="_1048576" value="0x7"/>
      </value-group>
      <value-group caption="" name="HSMCI_DMA__CHKSIZE">
        <value caption="1 data available" name="_1" value="0x0"/>
        <value caption="2 data available" name="_2" value="0x1"/>
        <value caption="4 data available" name="_4" value="0x2"/>
        <value caption="8 data available" name="_8" value="0x3"/>
        <value caption="16 data available" name="_16" value="0x4"/>
      </value-group>
      <value-group caption="" name="HSMCI_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0." name="PASSWD" value="0x4D4349"/>
      </value-group>
    </module>
    <module name="I2SC" caption="Inter-IC Sound Controller" id="11241" version="N">
      <register-group name="I2SC">
        <register caption="Control Register" name="I2SC_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Receiver Enable" mask="0x00000001" name="RXEN"/>
          <bitfield caption="Receiver Disable" mask="0x00000002" name="RXDIS"/>
          <bitfield caption="Clocks Enable" mask="0x00000004" name="CKEN"/>
          <bitfield caption="Clocks Disable" mask="0x00000008" name="CKDIS"/>
          <bitfield caption="Transmitter Enable" mask="0x00000010" name="TXEN"/>
          <bitfield caption="Transmitter Disable" mask="0x00000020" name="TXDIS"/>
          <bitfield caption="Software Reset" mask="0x00000080" name="SWRST"/>
        </register>
        <register caption="Mode Register" name="I2SC_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Inter-IC Sound Controller Mode" mask="0x00000001" name="MODE" values="I2SC_MR__MODE"/>
          <bitfield caption="Data Word Length" mask="0x0000001C" name="DATALENGTH" values="I2SC_MR__DATALENGTH"/>
          <bitfield caption="Data Format" mask="0x000000C0" name="FORMAT" values="I2SC_MR__FORMAT"/>
          <bitfield caption="Receive Mono" mask="0x00000100" name="RXMONO"/>
          <bitfield caption="Single or Multiple DMA Controller Channels for Receiver" mask="0x00000200" name="RXDMA"/>
          <bitfield caption="Loopback Test Mode" mask="0x00000400" name="RXLOOP"/>
          <bitfield caption="Transmit Mono" mask="0x00001000" name="TXMONO"/>
          <bitfield caption="Single or Multiple DMA Controller Channels for Transmitter" mask="0x00002000" name="TXDMA"/>
          <bitfield caption="Transmit Data when Underrun" mask="0x00004000" name="TXSAME"/>
          <bitfield caption="Selected Clock to I2SC Master Clock Ratio" mask="0x003F0000" name="IMCKDIV"/>
          <bitfield caption="Master Clock to fs Ratio" mask="0x3F000000" name="IMCKFS" values="I2SC_MR__IMCKFS"/>
          <bitfield caption="Master Clock Mode" mask="0x40000000" name="IMCKMODE"/>
          <bitfield caption="I2SC_WS Slot Width" mask="0x80000000" name="IWS"/>
        </register>
        <register caption="Status Register" name="I2SC_SR" offset="0x08" rw="R" size="4">
          <bitfield caption="Receiver Enabled" mask="0x00000001" name="RXEN"/>
          <bitfield caption="Receive Ready" mask="0x00000002" name="RXRDY"/>
          <bitfield caption="Receive Overrun" mask="0x00000004" name="RXOR"/>
          <bitfield caption="Transmitter Enabled" mask="0x00000010" name="TXEN"/>
          <bitfield caption="Transmit Ready" mask="0x00000020" name="TXRDY"/>
          <bitfield caption="Transmit Underrun" mask="0x00000040" name="TXUR"/>
          <bitfield caption="Receive Overrun Channel" mask="0x00000300" name="RXORCH"/>
          <bitfield caption="Transmit Underrun Channel" mask="0x00300000" name="TXURCH"/>
        </register>
        <register caption="Status Clear Register" name="I2SC_SCR" offset="0x0C" rw="W" size="4">
          <bitfield caption="Receive Overrun Status Clear" mask="0x00000004" name="RXOR"/>
          <bitfield caption="Transmit Underrun Status Clear" mask="0x00000040" name="TXUR"/>
          <bitfield caption="Receive Overrun Per Channel Status Clear" mask="0x00000300" name="RXORCH"/>
          <bitfield caption="Transmit Underrun Per Channel Status Clear" mask="0x00300000" name="TXURCH"/>
        </register>
        <register caption="Status Set Register" name="I2SC_SSR" offset="0x10" rw="W" size="4">
          <bitfield caption="Receive Overrun Status Set" mask="0x00000004" name="RXOR"/>
          <bitfield caption="Transmit Underrun Status Set" mask="0x00000040" name="TXUR"/>
          <bitfield caption="Receive Overrun Per Channel Status Set" mask="0x00000300" name="RXORCH"/>
          <bitfield caption="Transmit Underrun Per Channel Status Set" mask="0x00300000" name="TXURCH"/>
        </register>
        <register caption="Interrupt Enable Register" name="I2SC_IER" offset="0x14" rw="W" size="4" atomic-op="set:I2SC_IMR">
          <bitfield caption="Receiver Ready Interrupt Enable" mask="0x00000002" name="RXRDY"/>
          <bitfield caption="Receiver Overrun Interrupt Enable" mask="0x00000004" name="RXOR"/>
          <bitfield caption="Transmit Ready Interrupt Enable" mask="0x00000020" name="TXRDY"/>
          <bitfield caption="Transmit Underflow Interrupt Enable" mask="0x00000040" name="TXUR"/>
        </register>
        <register caption="Interrupt Disable Register" name="I2SC_IDR" offset="0x18" rw="W" size="4" atomic-op="clear:I2SC_IMR">
          <bitfield caption="Receiver Ready Interrupt Disable" mask="0x00000002" name="RXRDY"/>
          <bitfield caption="Receiver Overrun Interrupt Disable" mask="0x00000004" name="RXOR"/>
          <bitfield caption="Transmit Ready Interrupt Disable" mask="0x00000020" name="TXRDY"/>
          <bitfield caption="Transmit Underflow Interrupt Disable" mask="0x00000040" name="TXUR"/>
        </register>
        <register caption="Interrupt Mask Register" name="I2SC_IMR" offset="0x1C" rw="R" size="4" atomic-op="read:I2SC_IMR">
          <bitfield caption="Receiver Ready Interrupt Disable" mask="0x00000002" name="RXRDY"/>
          <bitfield caption="Receiver Overrun Interrupt Disable" mask="0x00000004" name="RXOR"/>
          <bitfield caption="Transmit Ready Interrupt Disable" mask="0x00000020" name="TXRDY"/>
          <bitfield caption="Transmit Underflow Interrupt Disable" mask="0x00000040" name="TXUR"/>
        </register>
        <register caption="Receiver Holding Register" name="I2SC_RHR" offset="0x20" rw="R" size="4">
          <bitfield caption="Receiver Holding Register" mask="0xFFFFFFFF" name="RHR"/>
        </register>
        <register caption="Transmitter Holding Register" name="I2SC_THR" offset="0x24" rw="W" size="4">
          <bitfield caption="Transmitter Holding Register" mask="0xFFFFFFFF" name="THR"/>
        </register>
      </register-group>
      <value-group caption="" name="I2SC_MR__MODE">
        <value caption="I2SC_CK and I2SC_WS pin inputs used as bit clock and word select/frame synchronization." name="SLAVE" value="0"/>
        <value caption="Bit clock and word select/frame synchronization generated by I2SC from MCK and output to I2SC_CK and I2SC_WS pins. Peripheral clock or GCLK is output as master clock on I2SC_MCK if I2SC_MR.IMCKMODE is set." name="MASTER" value="1"/>
      </value-group>
      <value-group caption="" name="I2SC_MR__DATALENGTH">
        <value caption="Data length is set to 32 bits" name="_32_BITS" value="0x0"/>
        <value caption="Data length is set to 24 bits" name="_24_BITS" value="0x1"/>
        <value caption="Data length is set to 20 bits" name="_20_BITS" value="0x2"/>
        <value caption="Data length is set to 18 bits" name="_18_BITS" value="0x3"/>
        <value caption="Data length is set to 16 bits" name="_16_BITS" value="0x4"/>
        <value caption="Data length is set to 16-bit compact stereo. Left sample in bits 15:0 and right sample in bits 31:16 of same word." name="_16_BITS_COMPACT" value="0x5"/>
        <value caption="Data length is set to 8 bits" name="_8_BITS" value="0x6"/>
        <value caption="Data length is set to 8-bit compact stereo. Left sample in bits 7:0 and right sample in bits 15:8 of the same word." name="_8_BITS_COMPACT" value="0x7"/>
      </value-group>
      <value-group caption="" name="I2SC_MR__FORMAT">
        <value caption="I2S format, stereo with I2SC_WS low for left channel, and MSB of sample starting one I2SC_CK period after I2SC_WS edge" name="I2S" value="0"/>
        <value caption="Left-justified format, stereo with I2SC_WS high for left channel, and MSB of sample starting on I2SC_WS edge" name="LJ" value="1"/>
      </value-group>
      <value-group caption="" name="I2SC_MR__IMCKFS">
        <value caption="Sample frequency ratio set to 32" name="M2SF32" value="0x0"/>
        <value caption="Sample frequency ratio set to 64" name="M2SF64" value="0x1"/>
        <value caption="Sample frequency ratio set to 96" name="M2SF96" value="0x2"/>
        <value caption="Sample frequency ratio set to 128" name="M2SF128" value="0x3"/>
        <value caption="Sample frequency ratio set to 192" name="M2SF192" value="0x5"/>
        <value caption="Sample frequency ratio set to 256" name="M2SF256" value="0x7"/>
        <value caption="Sample frequency ratio set to 384" name="M2SF384" value="0xB"/>
        <value caption="Sample frequency ratio set to 512" name="M2SF512" value="0xF"/>
        <value caption="Sample frequency ratio set to 768" name="M2SF768" value="0x17"/>
        <value caption="Sample frequency ratio set to 1024" name="M2SF1024" value="0x1F"/>
        <value caption="Sample frequency ratio set to 1536" name="M2SF1536" value="0x2F"/>
        <value caption="Sample frequency ratio set to 2048" name="M2SF2048" value="0x3F"/>
      </value-group>
    </module>
    <module name="ICM" caption="Integrity Check Monitor" id="11105" version="H">
      <register-group name="ICM">
        <register caption="Configuration Register" name="ICM_CFG" offset="0x00" rw="RW" size="4">
          <bitfield caption="Write Back Disable" mask="0x00000001" name="WBDIS"/>
          <bitfield caption="End of Monitoring Disable" mask="0x00000002" name="EOMDIS"/>
          <bitfield caption="Secondary List Branching Disable" mask="0x00000004" name="SLBDIS"/>
          <bitfield caption="Bus Burden Control" mask="0x000000F0" name="BBC"/>
          <bitfield caption="Automatic Switch To Compare Digest" mask="0x00000100" name="ASCD"/>
          <bitfield caption="Dual Input Buffer" mask="0x00000200" name="DUALBUFF"/>
          <bitfield caption="User Initial Hash Value" mask="0x00001000" name="UIHASH"/>
          <bitfield caption="User SHA Algorithm" mask="0x0000E000" name="UALGO" values="ICM_CFG__UALGO"/>
        </register>
        <register caption="Control Register" name="ICM_CTRL" offset="0x04" rw="W" size="4">
          <bitfield caption="ICM Enable" mask="0x00000001" name="ENABLE"/>
          <bitfield caption="ICM Disable Register" mask="0x00000002" name="DISABLE"/>
          <bitfield caption="Software Reset" mask="0x00000004" name="SWRST"/>
          <bitfield caption="Recompute Internal Hash" mask="0x000000F0" name="REHASH"/>
          <bitfield caption="Region Monitoring Disable" mask="0x00000F00" name="RMDIS"/>
          <bitfield caption="Region Monitoring Enable" mask="0x0000F000" name="RMEN"/>
        </register>
